adds better readme for architecture
